[
{
  "model": "data_management.termsandconditions",
  "pk": 1,
  "fields": {
    "version": "1",
    "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Terms & Conditions</title>\n</head>\n<body>\n    <h1>Terms & Conditions</h1>\n    <p><strong>Last updated:</strong> 12/12/2025</p>\n\n    <p>These Terms & Conditions (“Terms”) govern your access to and use of the reminder notification service (“FutureFlower”). By creating an account, submitting contact information, or scheduling an event, you agree to these Terms. If you do not agree, you must not use the Service.</p>\n\n    <h2>1. Definitions</h2>\n    <ul>\n        <li><strong>“Service”</strong> means the reminder notification system that delivers scheduled notifications using the contact methods you provide.</li>\n        <li><strong>“Event”</strong> means any reminder, notification, deadline, appointment, or other item created by the user.</li>\n        <li><strong>“User Content”</strong> means all information provided by the user, including event dates, times, descriptions, time zones, contact information.</li>\n        <li><strong>“Contact Methods”</strong> include email addresses, phone numbers, SMS-compatible numbers, backup contact numbers, social media accounts, or any additional communication channels provided by the user.</li>\n    </ul>\n\n    <h2>Product Description & Service</h2>\n    <h3>1. Nature of the Service</h3>\n    <p>Our service provides users with an additional layer of notification support for important future events (“Events”). Using the contact information supplied by the user, our system schedules and sends a series of reminder notifications across multiple communication channels. These channels may include, but are not limited to: email, SMS, backup emails, backup SMS numbers, social media accounts, phone calls, and designated emergency contacts.</p>\n    <p>The service is intended to assist users in remembering important dates. It does not replace the user’s own responsibility to track or attend the Event.</p>\n\n    <h3>2. Operation of Notification System</h3>\n    <p>When creating an Event, the user selects a time period before the Event during which notifications will begin (“Notification Window”). The system automatically divides this period into a series of time blocks and, based on those blocks, attempts to deliver notifications through the available channels.</p>\n    <p>The escalation of communication methods is automated and follows a general hierarchy. However, the exact timing, sequence, and channels used may vary based on system performance, availability of communication platforms, and the completeness or accuracy of the user’s provided contact information.</p>\n\n    <h3>3. No Guarantee of Delivery or Receipt</h3>\n    <p>While we make commercially reasonable efforts to send notifications according to the user’s settings, we do not guarantee that any notification will be delivered, received, read, acted upon, or successfully reach the intended recipient.</p>\n    <p>Delivery may fail or be delayed due to factors outside our control, including but not limited to carrier limitations, spam filters, API failures, platform restrictions, user device settings, service outages, incorrect or outdated contact information, or actions taken by third-party platforms.</p>\n\n    <h3>4. User Responsibility</h3>\n    <p>The user remains fully responsible for attending, complying with, or otherwise managing their Event and its associated obligations. Our service is an optional support tool only.</p>\n    <p>We accept no liability for any missed deadlines, appointments, obligations, legal requirements, fees, penalties, or damages arising from missed Events, whether or not notifications were sent or received.</p>\n\n    <h3>5. Emergency Contacts</h3>\n    <p>If the user provides emergency contact information, the user represents and warrants that:</p>\n    <ul>\n        <li>(a) the emergency contacts have given their explicit consent to be contacted on the user’s behalf; and</li>\n        <li>(b) the user accepts all responsibility for any consequences of such contact.</li>\n    </ul>\n    <p>We may contact emergency contacts only as part of the notification escalation process, and only using the details the user has supplied.</p>\n\n    <h3>6. Scope & Limitations</h3>\n    <p>The service does not verify the nature, accuracy, legality, or consequences of any Event. We are not a legal reminder service, medical reminder service, compliance service, financial planning tool, or safety-critical system.</p>\n    <p>The user must not rely on this service as their sole or primary method of remembering or acting upon an Event.</p>\n\n    <h2>Full Terms & Conditions</h2>\n    <h3>1. Description of the Service</h3>\n    <p>The Service provides an additional layer of notification by attempting to contact the user through multiple communication channels before the scheduled Event time.</p>\n    <p>Notification attempts may include:</p>\n    <ul>\n        <li>Emails</li>\n        <li>SMS or text messages</li>\n        <li>Backup email addresses</li>\n        <li>Backup phone numbers</li>\n        <li>Social media direct messages</li>\n        <li>Phone calls</li>\n        <li>Notifications to designated emergency contacts</li>\n    </ul>\n    <p>The notification sequence, timing, and escalation order are determined by the Service based on user settings and the selected start date for notifications.</p>\n    <p>The Service does not guarantee delivery of any notification, nor does it replace the user's own responsibility to track deadlines, appointments, or obligations.</p>\n\n    <h3>2. User Responsibilities</h3>\n    <p>The user agrees that:</p>\n    <ul>\n        <li>All information provided, including dates, times, time zones, and contact details, is accurate and up to date.</li>\n        <li>The user is solely responsible for selecting correct event details, including ensuring the event is scheduled in the correct time zone.</li>\n        <li>The user will only provide contact information they personally own or have full permission to use.</li>\n        <li>The user will not provide any emergency contact without that person’s clear consent.</li>\n        <li>The user maintains sole responsibility for meeting deadlines, complying with laws, paying bills, filing documents, or any obligations related to an Event.</li>\n    </ul>\n\n    <h3>3. Consent to Contact</h3>\n    <p>By using the Service, the user expressly consents to being contacted via all provided contact methods.</p>\n    <p>The user acknowledges that:</p>\n    <ul>\n        <li>Contact attempts may be automated or completed manually by staff.</li>\n        <li>Notifications may repeat, escalate, or be sent at multiple intervals.</li>\n        <li>Standard carrier or data charges may apply for SMS messages, calls, or mobile data.</li>\n        <li>Email or SMS providers, mobile carriers, and social media platforms may delay, block, filter, or prevent delivery.</li>\n        <li>They are solely responsible for ensuring access to the contact methods they provide.</li>\n        <li>The user must not provide any phone number, email, or social media account belonging to another person without their explicit permission.</li>\n    </ul>\n\n    <h3>4. Consent to Escalation and Emergency Contact Notifications</h3>\n    <p>By scheduling an Event, the user authorises the Service to escalate contact attempts using additional methods if earlier attempts fail.</p>\n    <p>Escalation may include contacting:</p>\n    <ul>\n        <li>Backup email addresses</li>\n        <li>Backup phone numbers</li>\n        <li>Social media accounts</li>\n        <li>The user via phone call</li>\n        <li>Emergency contacts</li>\n    </ul>\n    <p>The user agrees to indemnify and hold the Service harmless for any consequences of contacting an emergency contact, including disputes, complaints, or damages.</p>\n\n    <h3>5. Third-Party Platforms and Delivery Limitations</h3>\n    <p>Social media services, mobile carriers, email providers, and phone networks are operated by third parties.</p>\n    <p>The Service has no control over:</p>\n    <ul>\n        <li>Spam filtering</li>\n        <li>Network outages</li>\n        <li>Delivery failures</li>\n        <li>Carrier restrictions</li>\n        <li>Social media inbox rules</li>\n        <li>Account privacy settings</li>\n        <li>API limitations or changes</li>\n    </ul>\n    <p>The user acknowledges that these third-party factors may affect notification delivery.</p>\n\n    <h3>6. No Guarantee of Delivery or Performance</h3>\n    <p>The Service is an additional layer of protection, not a guarantee.</p>\n    <p>The Service is provided “as is” and “as available”, without warranty of:</p>\n    <ul>\n        <li>Delivery speed</li>\n        <li>Delivery success</li>\n        <li>Escalation timing</li>\n        <li>System uptime</li>\n        <li>Error-free performance</li>\n        <li>Notification accuracy</li>\n    </ul>\n    <p>The user remains fully responsible for all obligations associated with any Event.</p>\n\n    <h3>7. Limitation of Liability</h3>\n    <p>To the maximum extent permitted by law:</p>\n    <ul>\n        <li>The Service is not liable for any missed events, penalties, fees, expenses, losses, damages, or legal consequences arising from reliance on the Service.</li>\n        <li>The Service is not responsible for incorrect or incomplete User Content.</li>\n        <li>The Service is not responsible for failures caused by third-party platforms, outages, filtering, or technical limitations.</li>\n        <li>Total liability for any claim shall not exceed the total amount paid by the user for the specific Event associated with the claim.</li>\n    </ul>\n\n    <h3>8. Billing and Payments</h3>\n    <p>Users pay for each Event at the price listed at the time of purchase.</p>\n    <p>Fees are non-refundable except where required by law.</p>\n    <p>The user is responsible for any taxes or regulatory fees associated with their purchase.</p>\n\n    <h3>9. Termination</h3>\n    <p>The Service may suspend or terminate a user’s access if:</p>\n    <ul>\n        <li>Payment fails</li>\n        <li>Fraud, abuse, or misuse is detected</li>\n        <li>Contact information is invalid or causes delivery issues</li>\n        <li>The user violates these Terms</li>\n    </ul>\n    <p>The user may stop using the Service at any time, but no refunds will be issued for Events already purchased.</p>\n\n    <h3>10. Governing Law</h3>\n    <p>These Terms are governed by the laws of Australia.</p>\n    <p>Any disputes must be resolved in the courts of the relevant Australian state or territory.</p>\n\n    <h3>11. Changes to These Terms</h3>\n    <p>The Service may update these Terms from time to time.</p>\n    <p>Continued use after changes are published constitutes acceptance of the updated Terms.</p>\n</body>\n</html>\n",
    "published_at": "2026-02-17T21:33:47.098Z"
  }
}
]
