{"subject": "What do you think of this?", "custom_intro": "I just listened to the Zoom164 step 12 episode. Cool that it's a live Zoom every Tuesday — didn't know people did step work like that.", "email": "timmorganpersonal@gmail.com", "podcast_name": "Tim M London's AA + Al-Anon Talks", "host_name": "Tim M London", "website": "https://first164.blogspot.com/", "episode_count": 417, "latest_episode_title": "Tim M for CA Zoom164 Step 12-01 Chapter 7", "latest_episode_description": "From a sequence starting in 2025. You can join, live, each Tuesday, 7.30 p.m. Ireland time (the same as UK time)! Information about the sequence can be found here: https://first164.blogspot.com/p/zoom164.html", "feed_url": "https://anchor.fm/s/e0e6c374/podcast/rss", "apple_url": "https://podcasts.apple.com/us/podcast/tim-m-londons-aa-al-anon-talks/id1686814887?uo=4", "genre": "Spirituality", "last_release_date": "2026-02-25T17:03:00Z"}
{"subject": "Affiliate offer from FutureFlower", "custom_intro": "I just listened to the Monica episode. Interesting hearing an atheist's perspective on AA. Didn't realise secular meetings were a thing.", "email": "aanppodcastteam@gmail.com", "podcast_name": "An All Night Place - Secular AA", "host_name": "An All Night Place", "website": "https://www.allnightplace.com/", "episode_count": 101, "latest_episode_title": "EPISODE 107 - Monica", "latest_episode_description": "In this deeply personal episode, Monica joins us from Chicago to share her lived experience of long-term sobriety through secular recovery. Speaking candidly as a dual-diagnosed atheist, Monica reflects on more than a decade of struggle with alcoholism, drug-resistant bipolar depression, anxiety, repeated relapses, homelessness, and a near-fatal crisis that became a turning point in her life.She traces her journey from years of trying to make traditional recovery models work, through discovering the world of secular recovery during the COVID era, and ultimately building a sustainable, life-saving path that works for her. Monica speaks openly about Intensive Outpatient Programs, electroconvulsive therapy, alternative 12-step approaches, SMART Recovery, Recovery Dharma, atheist and agnostic AA spaces, and the importance of choice in recovery.This episode is also about connection. Monica shares how service, volunteering, community, and staying out of isolation have been essential to maintaining her sobriety. She offers thoughtful encouragement to newcomers, people who have relapsed, and those who are sober-curious, reminding us that recovery is not one-size-fits-all and that showing up matters more than perfection.A powerful, compassionate conversation about persistence, honesty, secular support, and why it’s never too late to find what finally sticks.", "feed_url": "https://anchor.fm/s/ee4b7974/podcast/rss", "apple_url": "https://podcasts.apple.com/us/podcast/an-all-night-place-secular-aa/id1720042989?uo=4", "genre": "Personal Journals", "last_release_date": "2026-02-22T20:30:00Z"}
{"subject": "What do you think of this?", "custom_intro": "I just listened to the female friendships episode. The part about making friends as an adult being so hard really resonated with me.", "email": "Lifeasweseeitpod@gmail.com", "podcast_name": "Life As We See It with A and A", "host_name": "LifeAsWeSeeItwithAA", "website": "https://lifeasweseeitpod.wixsite.com/life-as-we-see-it-po/podcast", "episode_count": 126, "latest_episode_title": "Dynamics of female friendships - Making friends, breakups & setting boundaries", "latest_episode_description": "We discuss the dynamics of female friendship in this episode. I am joined back again by my friend Enuma to share the importance and dynamics of female friendships. She shared her experience with her friend groups, what she looks out for in a friend, how she has become a better friend as she&#39;s grown older/matured especially around setting and respecting her friend&#39;s boundaries. We talked about deal breakers and red flags in friendships and signs of a good or bad friend. Making friends as an adult is particularly difficult especially when you&#39;re introverted but can be worth it when you find your tribe. We talked about how friendships can be cultural where different cultures e.g. Americans don&#39;t easily warm up to you even though you think they are your friends. If you are someone looking to make new friends or learn more about female friendship dynamics, this episode is for you. Hope you enjoyed watching it. Pls Like, Comment, Share and Subscribe #friends #friendship #femalefriendships #bestfriends #friendshipchallenges Please Subscribe and watch our YouTube channel: @LifeAsWeSeeItPodcast", "feed_url": "https://anchor.fm/s/e5790d34/podcast/rss", "apple_url": "https://podcasts.apple.com/us/podcast/life-as-we-see-it-with-a-and-a/id1699106198?uo=4", "genre": "Society & Culture", "last_release_date": "2026-02-17T20:00:00Z"}
{"subject": "Thoughts on this?", "custom_intro": "I just listened to the identity theft episode. The Daniel and Babylon analogy was a good one.", "email": "info@gravitos.org", "podcast_name": "The Parliament Raven", "host_name": "The Parliament Raven", "website": "https://gravitos.co/parliamentraven/", "episode_count": 81, "latest_episode_title": "Identity Theft: Recovering the Self the World Stole - The Parliament Raven Season 7 Ep6", "latest_episode_description": "The world is constantly trying to rename you, just like Babylon tried to rename Daniel and every label it offers pulls you further from your God-given identity.&nbsp;In this episode, we unpack why modern culture is obsessed with identity performance and how that obsession leaves believers spiritually disoriented and unrooted. Drawing from Daniel and Ephesians, we explore why identity confusion is spiritual warfare, not self-discovery, and how renewing the mind is really about reclaiming who God already named you to be. This is a call to reject counterfeit labels, resist modern Babylon, and recover the identity that no algorithm, culture, or trauma can steal.Find On Apple, Spotify, and Pandora PodcastsWebsite: https://www.theparliamentraven.comPatreaon: https://www.patreon.com/cw/TheParliamentRaven&nbsp;Merch: https://theparliamentraven.myshopify.com/", "feed_url": "https://gravitos.co/parliamentraven?format=rss", "apple_url": "https://podcasts.apple.com/us/podcast/the-parliament-raven/id1589804222?uo=4", "genre": "Spirituality", "last_release_date": "2026-02-14T14:00:00Z"}
{"subject": "Affiliate offer from FutureFlower", "custom_intro": "I just listened to the love is dead episode. The EVPs you caught at Beechworth were wild.", "email": "aussieafterlife@outlook.com", "podcast_name": "Aussie Afterlife", "host_name": "Aussie Afterlife- Hosted by Sam: Paranormal Investigator and Sole Creator of A.A", "website": "https://www.etsy.com/shop/AussieAfterlife", "episode_count": 61, "latest_episode_title": "Episode 59: Love is Dead at Mayday Hills: A Beechworth Collab to Keep Living For… 👻", "latest_episode_description": "The collab you have all been waiting for.. Beechworth paranormal investigation with Date night with the ghost gang (see part one on their channel in YouTube), Beyond the veil Aus podcast and Mel from Q station Sydney.. So much more to come… in this ep you will get the behind the scenes vibe of investigating with me, EVPs and just an all round good time..Plenty more to come! Grab a drink, relax and enjoy 👻", "feed_url": "https://anchor.fm/s/10b90a75c/podcast/rss", "apple_url": "https://podcasts.apple.com/us/podcast/aussie-afterlife/id1706722218?uo=4", "genre": "Documentary", "last_release_date": "2026-02-15T10:09:00Z"}
{"subject": "What do you think of this?", "custom_intro": "I just listened to the Thursday February 26th episode. Interesting hearing about the Hillary Clinton testimony.", "email": "abc.podcast.support@abc.com", "podcast_name": "World News Tonight with David Muir", "host_name": "ABC News", "website": "https://abcaudio.com/podcasts/world-news-tonight/", "episode_count": 260, "latest_episode_title": "Full Episode: Thursday, February 26, 2026", "latest_episode_description": "Rachel Scott reports on Hillary Clinton’s testimony before the Republican-led House Oversight Committee investigating convicted sex offender Jeffrey Epstein, and what she said to the public after the deposition; Martha Raddatz has the latest on the Florida speedboat shootout by Cuban forces, including U.S. officials confirming that at least one of the four people killed was an American citizen; Stephanie Ramos has details after sources say convicted stowaway Svetlana Dali sneaked onto a United Airlines flight from Newark to Milan; and more on tonight’s broadcast of World News Tonight with David Muir. Learn more about your ad choices. Visit podcastchoices.com/adchoices", "feed_url": "https://feeds.megaphone.fm/ESP4140596756", "apple_url": "https://podcasts.apple.com/us/podcast/world-news-tonight-with-david-muir/id218916008?uo=4", "genre": "Daily News", "last_release_date": "2026-02-27T03:30:00Z"}
{"subject": "Affiliate offer from FutureFlower", "custom_intro": "I just listened to the seagrass episode. Had no idea they were trialling those moorings in Sydney Harbour. Pretty cool.", "email": "abcpodcasts@abc.net.au", "podcast_name": "ABC KIDS News Time", "host_name": "Australian Broadcasting Corporation", "website": "https://www.abc.net.au/kidslisten/programs/news-time/", "episode_count": 300, "latest_episode_title": "Seagrass sowing & Nippers clubs growing", "latest_episode_description": "On today’s episode, we’re meeting some marine biologists saving endangered seagrass meadows!Plus, we're hearing about a new board game that is helping build people’s confidence…and their dragon knowledge.Quiz Questions1. Where are they trialling the environmentally friendly mooring? 2. How many gigalitres of water does the company want to take each year?3. How far is the Canberra Broulee Nippers club from the beach?4. What is the new board game called, in story number 2?5. How long had it been since a quoll joey had been born in the wild, in NSW?Answers1. The Sydney harbour!2. 40 gigalitres of water!3. 150km!4. DOTS or Dragons of the Spectrum5. A century!", "feed_url": "https://www.abc.net.au/feeds/9989710/podcast.xml", "apple_url": "https://podcasts.apple.com/us/podcast/abc-kids-news-time/id1414580769?uo=4", "genre": "Kids & Family", "last_release_date": "2026-02-19T20:00:00Z"}
